IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_gpio_ctrl_regs.xml
	<register id="GPBQSEL1" width="32" page="1" offset="0x42" internal="0" description="GPIO B Qualifier Select 1 Register (GPIO32 to 47)">
		<bitfield id="GPIO32" description="Select input qualification type for GPIO32" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Select input qualification type for GPIO33" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Select input qualification type for GPIO34" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Select input qualification type for GPIO35" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Select input qualification type for GPIO37" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Select input qualification type for GPIO39" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Select input qualification type for GPIO40" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Select input qualification type for GPIO41" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Select input qualification type for GPIO42" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Select input qualification type for GPIO43" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Select input qualification type for GPIO44" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Select input qualification type for GPIO45" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Select input qualification type for GPIO46" begin="29" end="28" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBQSEL2" width="32" page="1" offset="0x44" internal="0" description="GPIO B Qualifier Select 2 Register (GPIO48 to 63)">
		<bitfield id="GPIO61" description="Select input qualification type for GPIO61" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Select input qualification type for GPIO62" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Select input qualification type for GPIO63" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBMUX1" width="32" page="1" offset="0x46" internal="0" description="GPIO B Mux 1 Register (GPIO32 to 47)">
		<bitfield id="GPIO32" description="Defines pin-muxing selection for GPIO32" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Defines pin-muxing selection for GPIO33" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Defines pin-muxing selection for GPIO34" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Defines pin-muxing selection for GPIO35" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Defines pin-muxing selection for GPIO37" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Defines pin-muxing selection for GPIO39" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Defines pin-muxing selection for GPIO40" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Defines pin-muxing selection for GPIO41" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Defines pin-muxing selection for GPIO42" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Defines pin-muxing selection for GPIO43" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Defines pin-muxing selection for GPIO44" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Defines pin-muxing selection for GPIO45" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Defines pin-muxing selection for GPIO46" begin="29" end="28" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBMUX2" width="32" page="1" offset="0x48" internal="0" description="GPIO B Mux 2 Register (GPIO48 to 63)">
		<bitfield id="GPIO61" description="Defines pin-muxing selection for GPIO61" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Defines pin-muxing selection for GPIO62" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Defines pin-muxing selection for GPIO63" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBDIR" width="32" page="1" offset="0x4a" internal="0" description="GPIO B Direction Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
