IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_gpio_ctrl_regs.xml
	<register id="GPBPUD" width="32" page="1" offset="0x4c" internal="0" description="GPIO B Pull Up Disable Register (GPIO32 to 63) ">
		<bitfield id="GPIO32" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBINV" width="32" page="1" offset="0x50" internal="0" description="GPIO B Input Polarity Invert Registers (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBODR" width="32" page="1" offset="0x52" internal="0" description="GPIO B Open Drain Output Register (GPIO32 to GPIO63)">
		<bitfield id="GPIO32" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Outpout Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Outpout Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Outpout Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Outpout Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Outpout Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Outpout Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBGMUX1" width="32" page="1" offset="0x60" internal="0" description="GPIO B Peripheral Group Mux (GPIO32 to 47)">
		<bitfield id="GPIO32" description="Defines pin-muxing selection for GPIO32" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Defines pin-muxing selection for GPIO33" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Defines pin-muxing selection for GPIO34" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Defines pin-muxing selection for GPIO35" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Defines pin-muxing selection for GPIO37" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Defines pin-muxing selection for GPIO39" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Defines pin-muxing selection for GPIO40" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Defines pin-muxing selection for GPIO41" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Defines pin-muxing selection for GPIO42" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Defines pin-muxing selection for GPIO43" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Defines pin-muxing selection for GPIO44" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Defines pin-muxing selection for GPIO45" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Defines pin-muxing selection for GPIO46" begin="29" end="28" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBGMUX2" width="32" page="1" offset="0x62" internal="0" description="GPIO B Peripheral Group Mux (GPIO48 to 63)">
		<bitfield id="GPIO61" description="Defines pin-muxing selection for GPIO61" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Defines pin-muxing selection for GPIO62" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Defines pin-muxing selection for GPIO63" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPBLOCK" width="32" page="1" offset="0x7c" internal="0" description="GPIO B Lock Configuration Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBCR" width="32" page="1" offset="0x7e" internal="0" description="GPIO B Lock Commit Register (GPIO32 to 63)">
		<bitfield id="GPIO32" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCTRL" width="32" page="1" offset="0x1c0" internal="0" description="GPIO H Qualification Sampling Period Control (GPIO224 to 255)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO224 to GPIO231" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO232 to GPIO239" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO240 to GPIO247" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL1" width="32" page="1" offset="0x1c2" internal="0" description="GPIO H Qualifier Select 1 Register (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Select input qualification type for this GPIO Pin" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Select input qualification type for this GPIO Pin" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Select input qualification type for this GPIO Pin" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Select input qualification type for this GPIO Pin" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Select input qualification type for this GPIO Pin" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Select input qualification type for this GPIO Pin" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Select input qualification type for this GPIO Pin" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Select input qualification type for this GPIO Pin" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Select input qualification type for this GPIO Pin" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Select input qualification type for this GPIO Pin" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL2" width="32" page="1" offset="0x1c4" internal="0" description="GPIO H Qualifier Select 2 Register (GPIO240 to 255)">
		<bitfield id="GPIO241" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Select input qualification type for this GPIO Pin" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Select input qualification type for this GPIO Pin" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHMUX1" width="32" page="1" offset="0x1c6" internal="0" description="GPIO H Mux 1 Register (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Defines pin-muxing selection for GPIO224" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Defines pin-muxing selection for GPIO225" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Defines pin-muxing selection for GPIO226" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Defines pin-muxing selection for GPIO227" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Defines pin-muxing selection for GPIO228" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Defines pin-muxing selection for GPIO230" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Defines pin-muxing selection for GPIO231" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Defines pin-muxing selection for GPIO232" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Defines pin-muxing selection for GPIO233" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Defines pin-muxing selection for GPIO237" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Defines pin-muxing selection for GPIO238" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Defines pin-muxing selection for GPIO239" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHMUX2" width="32" page="1" offset="0x1c8" internal="0" description="GPIO H Mux 2 Register (GPIO240 to 255)">
		<bitfield id="GPIO241" description="Defines pin-muxing selection for GPIO241" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Defines pin-muxing selection for GPIO242" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Defines pin-muxing selection for GPIO244" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Defines pin-muxing selection for GPIO245" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHINV" width="32" page="1" offset="0x1d0" internal="0" description="GPIO H Input Polarity Invert Registers (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
